# Parameter Type Id Energy Analysis Space Json Property

Source: https://www.revitapidocs.com/2026/8a75322f-8b42-6ace-4780-bb3f31c362d4.htm

---

| Parameter Type Id Energy Analysis Space Json Property |
| --- |

"JSON data for Analytical Spaces"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId EnergyAnalysisSpaceJson { get; }
```

```
Public Shared ReadOnly Property EnergyAnalysisSpaceJson As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ EnergyAnalysisSpaceJson {
	ForgeTypeId^ get ();
}
```

```
static member EnergyAnalysisSpaceJson : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace